app/controllers/comments_controller.rb

  def create
    @comments = Comment.new
    @comments.content = params[:content]
    @comments.post_id = params[:post_id]
    @comments.save
---
INSERT INTO "comments" ("content", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "ff"], ["post_id", 3], ["created_at", "2018-05-31 10:05:45.476798"], ["updated_at", "2018-05-31 10:05:45.476798"]]

  def destroy
    destroy_comment = Comment.find(params[:comments_id])
    destroy_comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]