app/controllers/home_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "dd"], ["content", "dd"], ["created_at", "2018-05-31 09:47:35.300116"], ["updated_at", "2018-05-31 09:47:35.300116"]]
---
  def create
    @post = Post.new
    @post.title = params[:post_title]
    @post.content = params[:post_content]
    @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]
---
  def destroy
    post = Post.find(params[:post_id])
    post.destroy